In [2]:
import pandas as pd
import numpy as np

In [3]:
d = pd.Series(['hello','hi','how are you',np.nan,'you','me','bye'])

In [4]:
d.str.upper()

0          HELLO
1             HI
2    HOW ARE YOU
3            NaN
4            YOU
5             ME
6            BYE
dtype: object

In [5]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.478560 -0.021260  0.387574 -0.167593
1 -1.020364 -1.174515  0.113322  1.019769
2 -0.131418  2.156723 -0.206839 -1.040941
3 -0.447102  0.513429 -0.090550 -0.102985
4  1.197836 -0.789979  1.027222 -0.802061
5 -0.035719 -1.415940  2.280595  1.183275
6  0.840751 -1.886790  0.559764  1.300735
7 -0.836155 -0.659290  1.148652 -0.275116
8 -2.128905  1.015889  0.278386 -0.596702
9 -2.500166  0.037262 -0.625275  0.207940

In [6]:
pices = [ df[:3],df[3:6],df[6:]]

In [7]:
pices

[          0         1         2         3
 0 -0.478560 -0.021260  0.387574 -0.167593
 1 -1.020364 -1.174515  0.113322  1.019769
 2 -0.131418  2.156723 -0.206839 -1.040941,
           0         1         2         3
 3 -0.447102  0.513429 -0.090550 -0.102985
 4  1.197836 -0.789979  1.027222 -0.802061
 5 -0.035719 -1.415940  2.280595  1.183275,
           0         1         2         3
 6  0.840751 -1.886790  0.559764  1.300735
 7 -0.836155 -0.659290  1.148652 -0.275116
 8 -2.128905  1.015889  0.278386 -0.596702
 9 -2.500166  0.037262 -0.625275  0.207940]

In [8]:
df = pd.concat(pices)

In [9]:
df

          0         1         2         3
0 -0.478560 -0.021260  0.387574 -0.167593
1 -1.020364 -1.174515  0.113322  1.019769
2 -0.131418  2.156723 -0.206839 -1.040941
3 -0.447102  0.513429 -0.090550 -0.102985
4  1.197836 -0.789979  1.027222 -0.802061
5 -0.035719 -1.415940  2.280595  1.183275
6  0.840751 -1.886790  0.559764  1.300735
7 -0.836155 -0.659290  1.148652 -0.275116
8 -2.128905  1.015889  0.278386 -0.596702
9 -2.500166  0.037262 -0.625275  0.207940

In [10]:
df = pd.DataFrame([[1,2,3],[4,5,6]])

In [11]:
df1 = pd.DataFrame([[6,7,8],[9,10,11],[12,13,14]])

In [12]:
d = pd.concat([df,df1])

In [13]:
d

    0   1   2
0   1   2   3
1   4   5   6
0   6   7   8
1   9  10  11
2  12  13  14

In [23]:
d1 = { 'name':['sachin','rajat','nidhi'],'age':[22,30,25],'key':[1,2,3]}
d2 = { 'name':['kushal','ravi','gaurav'],'age':[24,35,32],'key':[1,2,3]}
d1 = pd.DataFrame(d1)
d2 = pd.DataFrame(d2)

In [27]:
df1 = pd.merge(d1,d2,on='key')
df2 = pd.concat([d1,d2])
print(df1)
print(df2)

   name_x  age_x  key  name_y  age_y
0  sachin     22    1  kushal     24
1   rajat     30    2    ravi     35
2   nidhi     25    3  gaurav     32
     name  age  key
0  sachin   22    1
1   rajat   30    2
2   nidhi   25    3
0  kushal   24    1
1    ravi   35    2
2  gaurav   32    3

In [25]:
df

   name_x  age_x  key  name_y  age_y
0  sachin     22    1  kushal     24
1   rajat     30    2    ravi     35
2   nidhi     25    3  gaurav     32